trade_exp/src/Documents/ПутевойЛист/ПутевойЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8c63e70a-01c7-47a3-a926-3460a02e9ce1">
  <name>ПутевойЛист</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="e61f4fee-8525-41a9-ad21-be5907fea38b">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="af4bbbdf-bdd0-4a2b-92f0-69dfe7f6ad3e">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="534f0f68-ab73-4b73-b4aa-76c411d4db64">
    <name>ТранспортноеСредство</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e280b4b8-12da-43b1-9c21-e2885a49f131">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="469b028e-bc82-483a-80b7-b022c3e41a51">
    <name>Топливо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ba54b8a0-0ed3-49e6-83ee-c66e6d0ac540">
    <name>СпидометрВозвращение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d758c7d1-0de0-4e12-b6cc-a671edd235ee">
    <name>РасходПоНорме</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="145d6da9-b26d-4e2c-987d-05777d491692">
    <name>РасходФактический</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e8810ab8-d445-4a82-ba44-3f386eefbf93">
    <name>ИзменитьПоказания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2300f4d4-aa5d-43dc-ae90-c4147d7f8ab1">
    <name>СпидометрНачало</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3fbaa6f1-d561-4ea9-b6e0-ef526257b5bb">
    <name>НормаРасхода</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ea7c213a-f9d3-4a24-9790-2d7b86c61133">
    <name>Механик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1efb3216-0528-4a44-a248-8f25eebff858">
    <name>АдресПодачи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="071f68be-a1cf-4538-a6ef-544948485ede">
    <name>ОстатокПриВыезде</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="789aac2b-5008-4c5d-ab96-5bf9fed580fb">
    <name>ОстатокПриВозвращении</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="181e9c13-926d-4768-b010-98a1a9e4f3d8">
    <name>Маршруты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="b599da77-70b0-488a-b526-9366a08b2bc9">
      <name>Дата</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="2c1473bf-f604-40b5-bbef-89fd2debcfdf">
      <name>МестоОтправления</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7965af58-cbdc-4643-a593-4ef31e9c9b97">
      <name>МестоНазначения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c0e3b695-1aed-4e99-9fde-1c366a175a6d">
      <name>Обратно</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="982b0fa0-6a0c-4a13-96c0-a35920f238e3">
      <name>Пройдено</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>7</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d706ee5a-4249-475e-9efd-2fc655f52d0d">
      <name>ВремяВыезда</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>5</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="3ece1aac-c39f-4cab-9539-f0a58be2b0a3">
      <name>ВремяВозвращения</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>5</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/ПутевойЛист/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВидимостьЭлементовФорм();
	ЗаполнитьПоказателиОстаткаТоплива();    
	
ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
КонецПроцедуры      

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды     

&НаСервере
Процедура ВидимостьЭлементовФорм()
	Элементы.ГруппаСпидометр.Видимость=Объект.ТранспортноеСредство.УчитыватьПоказанияСпидометра;
	//Элементы.ГруппаДвижениеГорючего.Видимость=Объект.Водитель.УчитыватьОстатокТоплива;
	Элементы.ГруппаОстатокГорючего.Видимость=Объект.Водитель.УчитыватьОстатокТоплива;
	Элементы.ГруппаОбновитьГСМ.Видимость=Объект.Водитель.УчитыватьОстатокТоплива;
	Элементы.СпидометрВозвращение.ТолькоПросмотр=не Объект.ИзменитьПоказания;
КонецПроцедуры
&НаСервере
Процедура ПересчетПоказателейНаСервере(режим=0)
	если Режим =1 тогда
		Объект.СпидометрНачало=Документы.ПутевойЛист.ПоказаниеСпидометра(Объект,Объект.ТранспортноеСредство);	
	конецесли;
	Объект.СпидометрВозвращение=Объект.СпидометрНачало+Объект.Маршруты.Итог("Пройдено");
	Объект.РасходПоНорме=Объект.НормаРасхода*Объект.ТранспортноеСредство.СпидометрСчетчик/100*Объект.Маршруты.Итог("Пройдено");
	Объект.РасходФактический=Объект.РасходПоНорме;
КонецПроцедуры
&НаКлиенте
Процедура МаршрутыПройденоПриИзменении(Элемент)
	ПересчетПоказателейНаСервере();
КонецПроцедуры
&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	ПодставитьЗначения();
КонецПроцедуры
&НаСервере
Процедура ПодставитьЗначения()
	Объект.ТранспортноеСредство="";
	Объект.Топливо="";
	Объект.НормаРасхода=0;
	Объект.ТранспортноеСредство=ДопМодуль.ТранспортноеСредство(Объект.Водитель);
	если не ЗначениеЗаполнено(Объект.Механик) тогда
		Объект.Механик=Объект.ТранспортноеСредство.Механик;
	конецесли;	
	ПриИзмененииТСНаСервере();
КонецПроцедуры
&НаКлиенте
Процедура ТранспортноеСредствоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	стандартнаяОбработка=ложь;
	если ЗНАЧЕНИЕЗАПОЛНЕНО(Объект.Водитель) тогда
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(ДопМодуль.СписокТранспортныхСредств(Объект.Водитель));
		если ДанныеВыбора.Количество()=0 тогда
			ТекстСообщения = НСтр("ru='За водителем %ФИО% не закреплено ни одного транспортного средства!'");
			ТекстСообщения=СтрЗаменить(ТекстСообщения,"%ФИО%",Объект.Водитель);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			Объект.Ссылка,
			);
		конецесли;	
		
	иначе
		ТекстСообщения = НСтр("ru='Не заполнен водитель транспортного средства!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ТекстСообщения,
		Объект.Ссылка,
		);
	конецесли;	
	
КонецПроцедуры
&НаКлиенте
Процедура ТопливоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	стандартнаяОбработка=ложь;
	если ЗНАЧЕНИЕЗАПОЛНЕНО(Объект.транспортноесредство) тогда
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(ДопМодуль.СписокноменклатурыТоплива(объект.ТранспортноеСредство,Объект.Дата));
		если ДанныеВыбора.Количество()=0 тогда
			ТекстСообщения = НСтр("ru='Для транспортного средства %ТС% не введены нормы расхода топлива на дату %Дата%'");
			ТекстСообщения=СТРЗАМЕНИТЬ(ТекстСообщения,"%ТС%",Объект.транспортноесредство);
			ТекстСообщения=СТРЗАМЕНИТЬ(ТекстСообщения,"%Дата%",Объект.Дата);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			Объект.Ссылка,
			);
		конецесли;	
		
	иначе
		ТекстСообщения = НСтр("ru='Не заполнено транспортное средство!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ТекстСообщения,
		Объект.Ссылка,
		);
		
	конецесли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоказанияСчетчика(Команда)
	ПересчетПоказателейНаСервере(1);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПоказанияПриИзменении(Элемент)
	ВидимостьЭлементовФорм();	
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьПоказателиОстаткаТоплива()
	если Объект.Водитель.УчитыватьОстатокТоплива тогда
		Объект.ОстатокПриВыезде=Документы.ПутевойЛист.ОстатокГСМ(Объект,Объект.Водитель.СкладТоплива,Объект.Топливо);
		ПересчетОстаткаТоплива();
	конецесли;	
КонецПроцедуры
&НаСервере
Процедура ПересчетОстаткаТоплива()
	Объект.ОстатокПриВозвращении=Объект.ОстатокПриВыезде-Объект.РасходФактический;
КонецПроцедуры
&НаКлиенте
Процедура РасходФактическийПриИзменении(Элемент)
	ПересчетОстаткаТоплива();
КонецПроцедуры
&НаКлиенте
Процедура ТранспортноеСредствоПриИзменении(Элемент)
	ПриИзмененииТСНаСервере();	
КонецПроцедуры
&НаКлиенте
Процедура ТопливоПриИзменении(Элемент)
	УстановитьНормуРасхода();
	ЗаполнитьПоказателиОстаткаТоплива();
КонецПроцедуры
&НаСервере
Процедура УстановитьНормуРасхода()
	Объект.НормаРасхода=0;
	Объект.НормаРасхода=ДопМодуль.ПолучитьНормуРасхода(Объект);
КонецПроцедуры
&НаСервере
Процедура ПриИзмененииТСНаСервере()
	Объект.Топливо="";
	Объект.НормаРасхода=0;

	ДанныеТоплива=ДопМодуль.ТопливоПоРасходу(Объект.ТранспортноеСредство);
	если ДанныеТоплива<>НЕОПРЕДЕЛЕНО тогда
		Объект.Топливо=ДанныеТоплива;
		Объект.НормаРасхода=ДопМодуль.ПолучитьНормуРасхода(Объект);
	конецесли;	
КонецПроцедуры


&НаКлиенте
Процедура МаршрутыПослеУдаления(Элемент)
ПересчетПоказателейНаСервере(1);	
КонецПроцедуры


&НаКлиенте
Процедура МаршрутыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
ПересчетПоказателейНаСервере(1);	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьОстаткиГСМ(Команда)
ЗаполнитьПоказателиОстаткаТоплива();	
КонецПроцедуры


&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	УстановитьНормуРасхода();
КонецПроцедуры
